README.md
```mermaid
graph TD

  internet[Cloud: Internet]
  router[Router<br>1.2.3.4]
  lanrouter[Router<br>192.168.0.1]
  pc[Computer<br>192.168.0.2]
  inverter[Inverter<br>192.168.0.3]
  ha[Home Assistant<br>192.168.0.4]
  mppt1[MPPT1]
  mppt2[MPPT2]
  battery[Battery]
  wallbox[Wallbox]

  internet <--> router
  router <--> lanrouter
  lanrouter <--> pc
  lanrouter <--Modbus TCP<br>LAN port--> inverter
  lanrouter <--> ha

  inverter --- mppt1
  inverter --- mppt2
  inverter <--CAN--> battery

  ha <--Modbus<br>RS485--> wallbox

```
